import DB
# Создание таблиц
# DB.init_db()

# Заполнение таблиц
'''
DB.insert_institutes(institutes=[('Аспирантура',), ('Байкальский институт БРИКС',), ('ИАиТ',), ('ИАСиД',), ('ИВТ',),
                              ('Институт заочно-вечернего обучения',), ('ИИТиАД',), ('ИН',), ('ИЭУиП',), ('ИЭ',)])
'''


'''
DB.insert_courses(courses=[('1 курс', 1), ('2 курс', 1), ('3 курс', 1), ('4 курс', 1),
                        ('1 курс', 2), ('2 курс', 2),
                        ('1 курс', 3), ('2 курс', 3), ('3 курс', 3), ('4 курс', 3), ('5 курс', 3),
                        ('1 курс', 4), ('2 курс', 4), ('3 курс', 4), ('4 курс', 4), ('5 курс', 4), ('6 курс', 4),
                        ('1 курс', 5), ('2 курс', 5), ('3 курс', 5), ('4 курс', 5),
                        ('1 курс', 6), ('2 курс', 6), ('3 курс', 6), ('4 курс', 6), ('5 курс', 6),
                        ('1 курс', 7), ('2 курс', 7), ('3 курс', 7), ('4 курс', 7),
                        ('1 курс', 8), ('2 курс', 8), ('3 курс', 8), ('4 курс', 8), ('5 курс', 6),
                        ('1 курс', 9), ('2 курс', 9), ('3 курс', 9), ('4 курс', 9),
                        ('1 курс', 10), ('2 курс', 10), ('3 курс', 10), ('4 курс', 10), ])
'''